{
    "tosContent": [
      "1. Introduction: Welcome to our social network. By using our services, you agree to comply with these Terms of Service and all applicable laws. These rules aim to ensure a safe, respectful, and enjoyable experience for all users.",
      "2. Registration: To create an account, you must provide accurate, complete, and up-to-date information. You are responsible for the confidentiality of your credentials and all activities performed with your account. Any unauthorized use must be reported immediately.",
      "3. User Content: You retain ownership of your content, but by posting on our platform, you grant us a non-exclusive, transferable, worldwide license to use, modify, publish, and distribute it within the service.",
      "4. User Conduct: It is prohibited to post defamatory, illegal, offensive, or violent content. Harassment, spam, or impersonation is strictly forbidden. Violations may result in account suspension or deletion.",
      "5. Privacy and Personal Data: We collect and use certain personal information according to our privacy policy. You agree that your data may be processed to improve the service and for targeted advertising if you have given consent.",
      "6. Advertising and Promotions: You understand that we may display ads and promotional content. You must not interfere with or manipulate these ads. The platform does not guarantee specific exposure for your content.",
      "7. Limitation of Liability: We do our best to ensure service availability but are not responsible for interruptions, data loss, or damages resulting from platform use. You use our services at your own risk.",
      "8. Suspension and Termination: We reserve the right to suspend or terminate your account if you violate the Terms of Service or any applicable law. Account deletion does not release you from past obligations, including content-related responsibilities.",
      "9. Changes to the Terms: We may update these terms at any time. Updates will be posted on our site and take effect immediately. Continued use of the service constitutes acceptance of the updated Terms.",
      "10. Governing Law and Jurisdiction: These Terms are governed by the laws of our country of incorporation. Any disputes regarding interpretation or application will be subject to competent courts.",
      "11. Miscellaneous: If any part of these Terms is deemed invalid or unenforceable, the remaining provisions remain in effect. Failure to exercise a right does not constitute waiver of that right.",
      "12. Acceptance: By checking the 'I accept the Terms of Service' box and creating an account, you confirm that you have read, understood, and accepted these Terms in their entirety."
    ]
  }
  
   