{
    "tosContent": [
      "1. Introducción: Bienvenido a nuestra red social. Al usar nuestros servicios, aceptas cumplir con estos Términos de Servicio y todas las leyes aplicables. Estas reglas tienen como objetivo garantizar una experiencia segura, respetuosa y agradable para todos los usuarios.",
      "2. Registro: Para crear una cuenta, debes proporcionar información precisa, completa y actualizada. Eres responsable de la confidencialidad de tus credenciales y de todas las actividades realizadas con tu cuenta. Cualquier uso no autorizado debe ser reportado inmediatamente.",
      "3. Contenido del usuario: Conservas la propiedad de tu contenido, pero al publicarlo en nuestra plataforma, nos otorgas una licencia no exclusiva, transferible y mundial para usarlo, modificarlo, publicarlo y distribuirlo dentro del servicio.",
      "4. Conducta del usuario: Está prohibido publicar contenido difamatorio, ilegal, ofensivo o violento. El acoso, el spam o la suplantación de identidad están estrictamente prohibidos. Las infracciones pueden resultar en la suspensión o eliminación de la cuenta.",
      "5. Privacidad y datos personales: Recopilamos y usamos cierta información personal de acuerdo con nuestra política de privacidad. Aceptas que tus datos puedan ser procesados para mejorar el servicio y para publicidad dirigida, si has dado tu consentimiento.",
      "6. Publicidad y promociones: Comprendes que podemos mostrar anuncios y contenido promocional. No debes interferir ni manipular estos anuncios. La plataforma no garantiza una exposición específica para tu contenido.",
      "7. Limitación de responsabilidad: Hacemos todo lo posible para garantizar la disponibilidad del servicio, pero no somos responsables de interrupciones, pérdida de datos o daños resultantes del uso de la plataforma. Usas nuestros servicios bajo tu propio riesgo.",
      "8. Suspensión y terminación: Nos reservamos el derecho de suspender o terminar tu cuenta si violas los Términos de Servicio o cualquier ley aplicable. La eliminación de la cuenta no te libera de obligaciones pasadas, incluidas las relacionadas con el contenido publicado.",
      "9. Cambios en los Términos: Podemos actualizar estos términos en cualquier momento. Las modificaciones se publicarán en nuestro sitio y entrarán en vigor inmediatamente. El uso continuo del servicio constituye aceptación de los Términos actualizados.",
      "10. Ley aplicable y jurisdicción: Estos Términos se rigen por las leyes de nuestro país de constitución. Cualquier disputa relacionada con la interpretación o aplicación estará sujeta a los tribunales competentes.",
      "11. Disposiciones varias: Si alguna parte de estos Términos se considera inválida o inaplicable, las disposiciones restantes permanecerán en vigor. La falta de ejercicio de un derecho no constituye renuncia al mismo.",
      "12. Aceptación: Al marcar la casilla 'Acepto los Términos de Servicio' y crear una cuenta, confirmas que has leído, comprendido y aceptado estos Términos en su totalidad."
    ]
  }
  