{
    "tosContent": [
      "1. Introduzione: Benvenuti nel nostro social network. Utilizzando i nostri servizi, accetti di rispettare questi Termini di servizio e tutte le leggi applicabili. Queste regole mirano a garantire un’esperienza sicura, rispettosa e piacevole per tutti gli utenti.",
      "2. Registrazione: Per creare un account, devi fornire informazioni accurate, complete e aggiornate. Sei responsabile della riservatezza delle tue credenziali e di tutte le attività effettuate con il tuo account. Qualsiasi uso non autorizzato deve essere segnalato immediatamente.",
      "3. Contenuti degli utenti: Mantieni la proprietà dei tuoi contenuti, ma pubblicando sulla nostra piattaforma ci concedi una licenza non esclusiva, trasferibile e mondiale per utilizzarli, modificarli, pubblicarli e distribuirli nell’ambito del servizio.",
      "4. Condotta degli utenti: È vietato pubblicare contenuti diffamatori, illegali, offensivi o violenti. Comportamenti di molestie, spam o impersonificazione sono severamente vietati. Le violazioni possono comportare la sospensione o la cancellazione dell’account.",
      "5. Privacy e dati personali: Raccogliamo e utilizziamo alcune informazioni personali in conformità con la nostra informativa sulla privacy. Accetti che i tuoi dati possano essere trattati per migliorare il servizio e per pubblicità mirata, se hai dato il tuo consenso.",
      "6. Pubblicità e promozioni: Comprendi che possiamo visualizzare pubblicità e contenuti promozionali. Non devi interferire o manipolare tali annunci. La piattaforma non garantisce esposizione specifica ai tuoi contenuti.",
      "7. Limitazione di responsabilità: Facciamo del nostro meglio per garantire la disponibilità del servizio, ma non siamo responsabili per interruzioni, perdita di dati o danni derivanti dall’utilizzo della piattaforma. Usi i nostri servizi a tuo rischio.",
      "8. Sospensione e terminazione: Ci riserviamo il diritto di sospendere o terminare il tuo account se violi i Termini di servizio o qualsiasi legge applicabile. La cancellazione dell’account non ti solleva dagli obblighi passati, inclusi quelli relativi ai contenuti pubblicati.",
      "9. Modifiche ai Termini: Possiamo aggiornare questi termini in qualsiasi momento. Le modifiche saranno pubblicate sul nostro sito ed entreranno in vigore immediatamente. L’uso continuato del servizio costituisce accettazione dei Termini aggiornati.",
      "10. Legge applicabile e giurisdizione: Questi Termini sono disciplinati dalle leggi del nostro paese di costituzione. Qualsiasi controversia relativa all’interpretazione o all’applicazione sarà sottoposta ai tribunali competenti.",
      "11. Varie: Se una parte di questi Termini è ritenuta invalida o inapplicabile, le restanti disposizioni rimangono in vigore. Il mancato esercizio di un diritto non costituisce rinuncia a tale diritto.",
      "12. Accettazione: Spuntando la casella 'Accetto i Termini di servizio' e creando un account, confermi di aver letto, compreso e accettato questi Termini nella loro interezza."
    ]
  }
  